In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

df = pd.read_csv('data/amazon_stock_data.csv')

In [2]:
df.head()

         Date      Open      High       Low     Close  Adj Close      Volume
0  1997-05-15  0.121875  0.125000  0.096354  0.097917   0.097917  1443120000
1  1997-05-16  0.098438  0.098958  0.085417  0.086458   0.086458   294000000
2  1997-05-19  0.088021  0.088542  0.081250  0.085417   0.085417   122136000
3  1997-05-20  0.086458  0.087500  0.081771  0.081771   0.081771   109344000
4  1997-05-21  0.081771  0.082292  0.068750  0.071354   0.071354   377064000

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6516 entries, 0 to 6515
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       6516 non-null   object
 1   Open       6516 non-null   float64
 2   High       6516 non-null   float64
 3   Low        6516 non-null   float64
 4   Close      6516 non-null   float64
 5   Adj Close  6516 non-null   float64
 6   Volume     6516 non-null   int64
dtypes: float64(5), int64(1), object(1)
memory usage: 356.5+ KB

In [4]:
df.isnull().sum()

Date         0
Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

In [6]:
cond = df['Open'] > 0.1
df[cond].head()

          Date      Open      High       Low     Close  Adj Close      Volume
0   1997-05-15  0.121875  0.125000  0.096354  0.097917   0.097917  1443120000
36  1997-07-08  0.102083  0.116667  0.102083  0.115104   0.115104   310344000
37  1997-07-09  0.115104  0.119271  0.113542  0.116146   0.116146   165240000
38  1997-07-10  0.116667  0.128646  0.116667  0.128125   0.128125   181032000
39  1997-07-11  0.126042  0.126042  0.110417  0.114583   0.114583   210624000

In [9]:
df.drop(columns=['Close']).tail()

            Date        Open        High         Low   Adj Close    Volume
6511  2023-03-30  101.550003  103.040001  101.010002  102.000000  53633400
6512  2023-03-31  102.160004  103.489998  101.949997  103.290001  56704300
6513  2023-04-03  102.300003  103.290001  101.430000  102.410004  41135700
6514  2023-04-04  102.750000  104.199997  102.110001  103.949997  48662500
6515  2023-04-05  103.910004  103.910004  100.750000  101.099998  45103000

In [10]:
df['Volume'].mean()

np.float64(142533820.3038674)

In [11]:
df['Volume'].median()

np.float64(105905000.0)

In [12]:
df[['Volume', 'High']].agg(['min', 'max', 'std'])

           Volume        High
min  9.744000e+06    0.072396
max  2.086584e+09  188.654007
std  1.401619e+08   48.659651

In [13]:
df['Volume'].quantile(0.3)

np.float64(75206000.0)

In [15]:
df['Date'].unique()

array(['1997-05-15', '1997-05-16', '1997-05-19', ..., '2023-04-03',
       '2023-04-04', '2023-04-05'], dtype=object)

In [16]:
df['Date'].nunique()

6516

In [17]:
df['Adj Close'].mode()

0    0.075521
Name: Adj Close, dtype: float64

In [18]:
df.describe()

,Open,High,Low,Close,Adj Close,Volume
count,6516.000000,6516.000000,6516.000000,6516.000000,6516.000000,6.516000e+03
mean,31.611626,31.991995,31.193432,31.599740,31.599740,1.425338e+08
std,48.095343,48.659651,47.464476,48.060258,48.060258,1.401619e+08
min,0.070313,0.072396,0.065625,0.069792,0.069792,9.744000e+06
25%,1.998875,2.028500,1.964750,2.001250,2.001250,6.888182e+07
50%,6.456750,6.535500,6.353250,6.444250,6.444250,1.059050e+08
75%,38.451375,38.688000,38.203001,38.464625,38.464625,1.607700e+08
max,187.199997,188.654007,184.839493,186.570496,186.570496,2.086584e+09

In [19]:
df.ndim

2

In [20]:
df.shape

(6516, 7)

In [21]:
df.index

RangeIndex(start=0, stop=6516, step=1)

In [22]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

In [23]:
df.loc[5, 'High']

np.float64(0.072396)

In [24]:
df.loc[5000:5020, ['Date', 'Low']]

            Date        Low
5000  2017-03-29  42.951000
5001  2017-03-30  43.583000
5002  2017-03-31  43.832500
5003  2017-04-03  44.271000
5004  2017-04-04  44.514000
5005  2017-04-05  45.280998
5006  2017-04-06  44.724499
5007  2017-04-07  44.465500
5008  2017-04-10  44.950001
5009  2017-04-11  44.875000
5010  2017-04-12  44.762501
5011  2017-04-13  44.224499
5012  2017-04-17  44.375000
5013  2017-04-18  45.039001
5014  2017-04-19  44.868500
5015  2017-04-20  44.814499
5016  2017-04-21  44.838501
5017  2017-04-24  45.191002
5018  2017-04-25  45.150002
5019  2017-04-26  45.377998
5020  2017-04-27  45.605499

In [25]:
cond = df['Low'] > 44
df.loc[cond].head()

,Date,Open,High,Low,Close,Adj Close,Volume
5003,2017-04-03,44.400002,44.674500,44.271000,44.575500,44.575500,68446000
5004,2017-04-04,44.575001,45.426998,44.514000,45.341499,45.341499,99694000
5005,2017-04-05,45.541000,46.186001,45.280998,45.464001,45.464001,150168000
5006,2017-04-06,45.689999,45.859501,44.724499,44.914001,44.914001,126882000
5007,2017-04-07,44.982498,45.004501,44.465500,44.743999,44.743999,74218000

In [35]:
cond = df['Date'].str.contains('2020')  #str.contains -> () 안의 문자열 포함되는 것
df.loc[cond].head()

,Date,Open,High,Low,Close,Adj Close,Volume
5695,2020-01-02,93.750000,94.900497,93.207497,94.900497,94.900497,80580000
5696,2020-01-03,93.224998,94.309998,93.224998,93.748497,93.748497,75288000
5697,2020-01-06,93.000000,95.184502,93.000000,95.143997,95.143997,81236000
5698,2020-01-07,95.224998,95.694504,94.601997,95.343002,95.343002,80898000
5699,2020-01-08,94.902000,95.550003,94.321999,94.598503,94.598503,70160000

In [42]:
c1 = cond = df['Date'].str.contains('2023')
c2 = df['Open'] > 100
c3 = df['Low'] > 100

df.loc[c1 & c2 & c3].head(10)

,Date,Open,High,Low,Close,Adj Close,Volume
6470,2023-01-31,101.160004,103.349998,101.139999,103.129997,103.129997,66527300
6471,2023-02-01,102.529999,106.239998,101.239998,105.150002,105.150002,80450100
6472,2023-02-02,110.250000,114.000000,108.879997,112.910004,112.910004,158154200
6473,2023-02-03,105.260002,108.779999,102.519997,103.389999,103.389999,144374800
6474,2023-02-06,102.930000,103.949997,100.650002,102.180000,102.180000,81945200
6511,2023-03-30,101.550003,103.040001,101.010002,102.000000,102.000000,53633400
6512,2023-03-31,102.160004,103.489998,101.949997,103.290001,103.290001,56704300
6513,2023-04-03,102.300003,103.290001,101.430000,102.410004,102.410004,41135700
6514,2023-04-04,102.750000,104.199997,102.110001,103.949997,103.949997,48662500
6515,2023-04-05,103.910004,103.910004,100.750000,101.099998,101.099998,45103000

In [60]:
cond = df['Open'] < 0.09
df['Open'].where(cond, 0).head(10)

0    0.000000
1    0.000000
2    0.088021
3    0.086458
4    0.081771
5    0.071875
6    0.070313
7    0.075521
8    0.081250
9    0.077083
Name: Open, dtype: float64

In [62]:
import matplotlib.pyplot as plt
plt.figure()

In [66]:
##도식화 함수를 여기에 쓰지는 못하나??

In [ ]:
#plt.plot()
#plt.show